app/Helpers/log_helper.php

    function helper_log($action, $description)
    {
        $db = \Config\Database::connect();
        $session = \Config\Services::session();

        $userId = $session->get('user_id') ?? 1;

        $data = [
            'user_id'     => $userId,
            'action'      => strtoupper($action),
            'description' => $description,
            'created_at'  => date('Y-m-d H:i:s'),
            'updated_at'  => date('Y-m-d H:i:s'),
        ];

        return $db->table('activity_logs')->insert($data);
---
INSERT INTO `activity_logs` (`user_id`, `action`, `description`, `created_at`, `updated_at`) VALUES ('1', 'UPDATE', 'Mengubah data barang: kopi areb (ID: 13)', '2026-01-14 15:12:09', '2026-01-14 15:12:09')