app/Controllers/ActivityLog.php

    public function index()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('activity_logs');

        // Pastikan kita mengambil username dari tabel users
        // Gunakan alias 'pelaku' agar sesuai dengan yang dipanggil di View
        $builder->select('activity_logs.*, users.username as pelaku');

        // Join menggunakan LEFT JOIN agar log tetap muncul meskipun user sudah dihapus
        $builder->join('users', 'users.user_id = activity_logs.user_id', 'left');

        $filterAksi = $this->request->getGet('filter_aksi');
        if (!empty($filterAksi)) {
            $builder->where('activity_logs.action', $filterAksi);
        }

        // Urutkan berdasarkan waktu terbaru
        $query = $builder->orderBy('activity_logs.created_at', 'DESC')->get();
---
SELECT `activity_logs`.*, `users`.`username` as `user_name`
FROM `activity_logs`
LEFT JOIN `users` ON `users`.`user_id` = `activity_logs`.`user_id`
WHERE `activity_logs`.`action` = 'UPDATE'
ORDER BY `activity_logs`.`created_at` DESC