app/Controllers/Auth.php

   public function login()
{
    $session = session();
    $model = new UserModel();

    $rules = [
        'email'    => 'required|valid_email',
        'password' => 'required|min_length[5]',
    ];

    if (!$this->validate($rules)) {
        return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
    }

    $email = trim($this->request->getVar('email'));
    $password = trim($this->request->getVar('password'));

    $user = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'rendi@gmail.com'
 LIMIT 1