app/Controllers/Auth.php

    public function login()
    {
        $session = session();
        $model = new UserModel();

        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required|min_length[5]',
        ];

        if (!$this->validate($rules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $email = trim($this->request->getVar('email'));
        $password = trim($this->request->getVar('password'));

        $user = $model->select('users.*, roles.role_name')
                      ->join('roles', 'roles.role_id = users.role_id')
                      ->where('email', $email)
                      ->first();
---
SELECT `users`.*, `roles`.`role_name`
FROM `users`
JOIN `roles` ON `roles`.`role_id` = `users`.`role_id`
WHERE `email` = 'admin@mail.com'
 LIMIT 1