app/Controllers/Customer.php

    public function index()
    {
        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $this->customerModel->like('name_customer', $keyword);
        }

        $data = [
            'title'     => 'Daftar Customer',
            'customers' => $this->customerModel->paginate(5, 'customer'),
---
SELECT *
FROM `customers`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `customers`