app/Controllers/Dashboard.php

SELECT SUM(`total_amount`) AS `total_amount`
FROM `orders`
WHERE MONTH(order_date) = '01'
AND YEAR(order_date) = '2026'
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `order_status` = 'Pending'
---
  public function index()
{
    $db = \Config\Database::connect();

    // 1. Mengambil total pendapatan bulan ini
    // Menggunakan 'order_date' karena 'created_at' tidak ada di tabel orders
    $monthly = $db->table('orders')
        ->selectSum('total_amount')
        ->where('MONTH(order_date)', date('m'))
        ->where('YEAR(order_date)', date('Y'))
        ->get()->getRow();

    // 2. Menghitung total pelanggan dari tabel 'customers' (Sesuai Gambar PMA Anda)
    $totalPelanggan = $db->table('customers')->countAllResults();

    // 3. Menghitung jumlah order yang pending
    $pending = $db->table('orders')
        ->where('order_status', 'Pending')
        ->countAllResults();