app/Controllers/Items.php

    public function index()
    {
        $keyword = $this->request->getVar('keyword');

        // Target Poin 3: Pencarian & Paginasi
        if ($keyword) {
            $this->itemModel->like('item_name', $keyword);
        }

        $data = [
            'items' => $this->itemModel->paginate(5, 'items'),
            'pager' => $this->itemModel->pager,
            'keyword' => $keyword
        ];
---
SELECT *
FROM `items`
WHERE `item_name` LIKE '%try%' ESCAPE '!'
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `items`
WHERE `item_name` LIKE '%try%' ESCAPE '!'

    public function update($id)
{
    // Validasi data (Poin 2 Target Anda)
    if (!$this->validate([
        'item_name' => "required|is_unique[items.item_name,item_id,$id]",
        'price'     => 'required|numeric',
        'stock_quantity' => 'required|integer'
    ])) {
        return redirect()->back()->withInput();
    }

    // Update ke database
    $this->itemModel->update($id, [
        'item_name'      => $this->request->getPost('item_name'),
        'price'          => $this->request->getPost('price'),
        'stock_quantity' => $this->request->getPost('stock_quantity'),
    ]);
---
UPDATE `items` SET `item_name` = 'kopi areb', `price` = '40000.00', `stock_quantity` = '12'
WHERE `items`.`item_id` IN ('13')