app/Controllers/Order.php

SELECT *
FROM `customers`
SELECT *
FROM `items`
---
    public function create()
    {
        $customerModel = new CustomerModel();
        $data['customers'] = $customerModel->findAll();

        $itemModel = new ItemModel();
        $data['products'] = $itemModel->findAll();

INSERT INTO `orders` (`user_id`, `id_customer`, `order_date`, `total_amount`, `order_status`) VALUES ('1', '4', '2026-01-11 05:52:59', '1710000', 'Completed')
---
    public function store()
    {
        $db = \Config\Database::connect();
        $orderModel = new OrderModel();
        $orderItemModel = new OrderItemModel();

        // 1. Ambil data dari form
        $items = $this->request->getPost('items');
        $totalAmount = $this->request->getPost('total_grand');
        $customerId = $this->request->getPost('customer_id');

        // Validasi Awal: Pastikan data tidak kosong
        if (empty($customerId) || empty($items)) {
            return redirect()->back()->withInput()->with('error', 'Lengkapi data pelanggan dan pilih minimal satu produk!');
        }

        // Mulai Transaksi Database
        $db->transStart();

        try {
            // A. Simpan ke tabel 'orders'
            $orderData = [
                'user_id'      => session()->get('user_id') ?? 1,
                'id_customer'  => $customerId,
                'order_date'   => date('Y-m-d H:i:s'),
                'total_amount' => $totalAmount,
                'order_status' => 'Completed'
            ];

            if (!$orderModel->insert($orderData)) {

SELECT *
FROM `items`
WHERE `item_id` = '8'
---
                if (empty($item['product_id']) || empty($item['qty'])) continue;

                // 1. AMBIL DATA STOK TERBARU (Sesuai gambar DB Anda: item_id)
                $currentProduct = $db->table('items')
                    ->where('item_id', $item['product_id'])
                    ->get()
                    ->getRowArray();

SELECT `orders`.*, `customers`.`name_customer`
FROM `orders`
JOIN `customers` ON `customers`.`id_customer` = `orders`.`id_customer`
ORDER BY `orders`.`order_date` DESC
---
    public function index()
    {
        $orderModel = new OrderModel();
        // Menggunakan join agar bisa menampilkan nama customer
        $data['orders'] = $orderModel->select('orders.*, customers.name_customer')
            ->join('customers', 'customers.id_customer = orders.id_customer')
            ->orderBy('orders.order_date', 'DESC')
            ->findAll();

SELECT `orders`.*, `customers`.`name_customer`
FROM `orders`
JOIN `customers` ON `customers`.`id_customer` = `orders`.`id_customer`
WHERE `orders`.`order_id` = '33'
SELECT `order_items`.*, `items`.`item_name`, `items`.`price` as `unit_price`
FROM `order_items`
JOIN `items` ON `items`.`item_id` = `order_items`.`item_id`
WHERE `order_id` = '33'
---
    public function detail($id)
    {
        $orderModel = new OrderModel();
        $orderItemModel = new OrderItemModel();

        $data['order'] = $orderModel->select('orders.*, customers.name_customer')
            ->join('customers', 'customers.id_customer = orders.id_customer')
            ->find($id);

        if (!$data['order']) {
            return redirect()->to('/order')->with('error', 'Data transaksi tidak ditemukan!');
        }

        $data['items'] = $orderItemModel->select('order_items.*, items.item_name, items.price as unit_price')
            ->join('items', 'items.item_id = order_items.item_id')
            ->where('order_id', $id)
            ->findAll();