app/Controllers/User.php

SELECT COUNT(*) AS `numrows`
FROM `users`
JOIN `roles` ON `roles`.`role_id` = `users`.`role_id`
SELECT `users`.*, `roles`.`role_name`
FROM `users`
JOIN `roles` ON `roles`.`role_id` = `users`.`role_id`
 LIMIT 10
---
    public function index()
    {
        // Join agar role_name muncul di tabel
        $this->userModel->select('users.*, roles.role_name');
        $this->userModel->join('roles', 'roles.role_id = users.role_id');

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $this->userModel->like('username', $keyword)->orLike('email', $keyword);
        }

        $data = [
            'title' => 'Manajemen User',
            'users' => $this->userModel->paginate(10, 'user'),

INSERT INTO `users` (`username`, `email`, `password`, `role_id`, `created_at`, `updated_at`) VALUES ('try', 'try@gamil.com', '$2y$10$2Gefv0Uc.wj8VqqmP2QYnOeXFd4eXJaK3Ip6QXb/hYbN4FWCuJLkK', '1', '2025-12-26 17:19:20', '2025-12-26 17:19:20')
---
    public function save()
    {
        // 1. Perbaikan: Sesuaikan validasi dengan nama input di form (role_id)
        if (!$this->validate([
            'username' => 'required|is_unique[users.username]|min_length[3]',
            'email'    => 'required|valid_email|is_unique[users.email]',
            'password' => 'required|min_length[5]',
            'role_id'  => 'required'
        ])) {
            return redirect()->to('/users/create')->withInput();
        }

        // 2. Perbaikan: Simpan ke kolom 'role_id' bukan 'role'
        $this->userModel->save([
            'username'  => $this->request->getVar('username'),
            'email'     => $this->request->getVar('email'),
            'password'  => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            'role_id'   => $this->request->getVar('role_id'),
        ]);